app/controllers/blogs_controller.rb

UPDATE "blogs" SET "body" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["body", "content this blog\nhello"], ["updated_at", "2022-12-15 17:45:22.980689"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)